# StairsAlreadyAttachedToCurrentLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsAlreadyAttachedToCurrentLevel Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Mutistory Stairs already have a Stair attaching to this level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsAlreadyAttachedToCurrentLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAlreadyAttachedToCurrentLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsAlreadyAttachedToCurrentLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace